Repository: CofficLab/Lumi
Catalog: LumiApp/Plugins/EditorPreviewPlugin/EditorPreview.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: cached
zh_hans: 已缓存
zh_hk: 已快取

# %g x %g pt
source: %1$g x %2$g pt
zh_hans: %g x %g pt
zh_hk: %g x %g pt

source: Available
zh_hans: 可用
zh_hk: 可用

# Build %@%@
source: Build %1$@%2$@
zh_hans: 构建 %@%@
zh_hk: 建置 %@%@

source: Build product was not found.
zh_hans: 未找到构建产物。
zh_hk: 找不到建置產物。

source: Connected
zh_hans: 已连接
zh_hk: 已連接

source: Copied
zh_hans: 已复制
zh_hk: 已複製

source: Copy Details
zh_hans: 复制详情
zh_hk: 複製詳情

source: Copy Error
zh_hans: 复制错误
zh_hk: 複製錯誤

source: Default Localization
zh_hans: 默认本地化
zh_hk: 預設本地化

source: Default Localization (%@)
zh_hans: 默认本地化（%@）
zh_hk: 預設本地化（%@）

source: Delete %lld stale string catalog entries
zh_hans: 删除 %lld 个废弃字符串目录条目
zh_hk: 刪除 %lld 個已棄用字串目錄項目

source: Diagnostics
zh_hans: 诊断
zh_hk: 診斷

source: Display
zh_hans: 显示
zh_hk: 顯示

source: Failed
zh_hans: 失败
zh_hk: 失敗

source: Failed to delete stale string catalog entries: %@
zh_hans: 删除废弃字符串目录条目失败：%@
zh_hk: 刪除已棄用字串目錄項目失敗：%@

source: Failed to load image: %@
zh_hans: 加载图片失败：%@
zh_hk: 載入圖片失敗：%@

source: Failed to load string catalog: %@
zh_hans: 加载字符串目录失败：%@
zh_hk: 載入字串目錄失敗：%@

source: Failure
zh_hans: 失败
zh_hk: 失敗

source: File not found: %@
zh_hans: 文件不存在：%@
zh_hk: 找不到檔案：%@

source: Fix the compilation errors in the source file and save to trigger a rebuild.
zh_hans: 修复源文件中的编译错误，保存后触发重新构建。
zh_hk: 修復原始檔案中的編譯錯誤，儲存後觸發重新建置。

source: Frame
zh_hans: 帧
zh_hk: 影格

source: Frame %lld - %lldx%lld @%@x
zh_hans: 帧 %lld - %lldx%lld @%@x
zh_hk: 影格 %lld - %lldx%lld @%@x

source: Frame Pending
zh_hans: 帧等待中
zh_hk: 影格等待中

source: Hide Details
zh_hans: 收起详情
zh_hk: 收合詳情

source: Host
zh_hans: 宿主
zh_hk: 宿主

source: Hot preview host executable was not found.
zh_hans: 未找到热预览宿主程序。
zh_hk: 未找到熱預覽宿主程式。

source: Idle
zh_hans: 空闲
zh_hk: 閒置

source: Image
zh_hans: 图像
zh_hk: 圖像

source: Image Preview
zh_hans: 图像预览
zh_hk: 圖像預覽

source: Key
zh_hans: 键
zh_hk: 鍵

source: Launching
zh_hans: 启动中
zh_hk: 啟動中

source: Line %lld-%lld
zh_hans: 第 %lld-%lld 行
zh_hk: 第 %lld-%lld 行

source: Live
zh_hans: 实时
zh_hk: 即時

source: Live Error
zh_hans: 实时错误
zh_hk: 即時錯誤

source: Live mode is preferred, but the host is currently showing image preview.
zh_hans: 首选实时模式，但宿主当前显示图片预览。
zh_hk: 首選即時模式，但宿主當前顯示圖片預覽。

source: Live Preview Error
zh_hans: 实时预览错误
zh_hk: 即時預覽錯誤

source: Live preview failed
zh_hans: 实时预览失败
zh_hk: 即時預覽失敗

source: Live preview is starting
zh_hans: 实时预览启动中
zh_hk: 即時預覽啟動中

source: Live preview stopped
zh_hans: 实时预览已停止
zh_hk: 即時預覽已停止

source: Live requires a real SwiftUI view entry
zh_hans: 实时模式需要真实的 SwiftUI 视图入口
zh_hk: 即時模式需要真實的 SwiftUI 視圖入口

# Load %@%@
source: Load %1$@%2$@
zh_hans: 加载 %@%@
zh_hk: 載入 %@%@

source: Loading image...
zh_hans: 正在加载图片...
zh_hk: 正在載入圖片...

source: Markdown Preview
zh_hans: Markdown 预览
zh_hk: Markdown 預覽

source: Mode
zh_hans: 模式
zh_hk: 模式

source: No #Preview in the current Swift file
zh_hans: 当前 Swift 文件中没有 #Preview
zh_hk: 當前 Swift 檔案中沒有 #Preview

source: No build target found for %@
zh_hans: 未找到 %@ 的构建目标
zh_hk: 找不到 %@ 的建置目標

source: No Frame
zh_hans: 无帧
zh_hk: 無幀

source: No Preview
zh_hans: 无预览
zh_hk: 無預覽

source: No stale string catalog entries
zh_hans: 没有废弃字符串目录条目
zh_hk: 沒有已棄用字串目錄項目

source: Performance
zh_hans: 性能
zh_hk: 效能

source: Preview
zh_hans: 预览
zh_hk: 預覽

source: Preview Failed
zh_hans: 预览失败
zh_hk: 預覽失敗

source: Preview ID
zh_hans: 预览 ID
zh_hk: 預覽 ID

source: Preview powered by LumiPreviewKit
zh_hans: 由 LumiPreviewKit 驱动的预览
zh_hk: 由 LumiPreviewKit 驅動的預覽

source: Previews
zh_hans: 预览列表
zh_hk: 預覽列表

source: Rebuilding hot preview. Showing the previous frame.
zh_hans: 正在重新构建热预览，显示上一帧。
zh_hk: 正在重新構建熱預覽，顯示上一幀。

source: Refresh %@
zh_hans: 刷新 %@
zh_hk: 重新整理 %@

source: Refresh hot preview
zh_hans: 刷新热预览
zh_hk: 重新整理熱預覽

source: Refreshing Preview
zh_hans: 正在刷新预览
zh_hk: 正在重新整理預覽

source: Render
zh_hans: 渲染
zh_hk: 算繪

source: Rendering
zh_hans: 渲染中
zh_hk: 算繪中

source: Running
zh_hans: 运行中
zh_hk: 執行中

source: Show Details
zh_hans: 展开详情
zh_hk: 展開詳情

source: Showing the previous frame because no fresh frame is available yet.
zh_hans: 显示上一帧，因为尚无新帧可用。
zh_hk: 顯示上一幀，因為尚無新幀可用。

source: Start a preview first
zh_hans: 请先启动预览
zh_hk: 請先啟動預覽

source: Start hot preview
zh_hans: 启动热预览
zh_hk: 啟動熱預覽

source: Start hot preview to render a frame
zh_hans: 启动热预览以渲染帧
zh_hk: 啟動熱預覽以算繪幀

source: Starting hot live preview
zh_hans: 正在启动热实时预览
zh_hk: 正在啟動熱即時預覽

source: Starting live preview.
zh_hans: 正在启动实时预览。
zh_hk: 正在啟動即時預覽。

source: Stop hot preview
zh_hans: 停止热预览
zh_hk: 停止熱預覽

source: Stopped
zh_hans: 已停止
zh_hk: 已停止

source: String Catalog Preview
zh_hans: 字符串目录预览
zh_hk: 字串目錄預覽

source: Switch to Image mode to see the static preview, or ensure the #Preview macro returns a SwiftUI View.
zh_hans: 切换到图像模式查看静态预览，或确保 #Preview 宏返回 SwiftUI 视图。
zh_hk: 切換到圖像模式檢視靜態預覽，或確保 #Preview 巨集回傳 SwiftUI 視圖。

source: Switch to Live mode
zh_hans: 切换到实时模式
zh_hk: 切換到即時模式

source: The current image could not be loaded.
zh_hans: 当前图片无法加载。
zh_hk: 目前圖片無法載入。

source: The current Markdown content is unavailable.
zh_hans: 当前 Markdown 内容不可用。
zh_hk: 目前 Markdown 內容不可用。

source: The current string catalog could not be loaded.
zh_hans: 当前字符串目录无法加载。
zh_hk: 目前的字串目錄無法載入。

source: The preview process crashed. Try restarting the preview. Check the source for runtime issues.
zh_hans: 预览进程崩溃。尝试重启预览。检查源文件中的运行时问题。
zh_hk: 預覽程序當機。嘗試重啟預覽。檢查原始檔案中的執行時期問題。

source: Timed out after %lld seconds.
zh_hans: %lld 秒后超时。
zh_hk: %lld 秒後逾時。

source: Toggle diagnostics info
zh_hans: 切换诊断信息
zh_hk: 切換診斷資訊

source: Transport
zh_hans: 传输
zh_hk: 傳輸

source: Try refreshing the preview. If the issue persists, stop and restart the preview session.
zh_hans: 尝试刷新预览。如果问题持续，停止并重新启动预览会话。
zh_hk: 嘗試重新整理預覽。如果問題持續，停止並重新啟動預覽工作階段。

source: Try switching to Image mode or restarting the preview session.
zh_hans: 尝试切换到图像模式或重启预览会话。
zh_hk: 嘗試切換到圖像模式或重啟預覽工作階段。

source: Unavailable
zh_hans: 不可用
zh_hk: 不可用

source: Unsupported project type: %@
zh_hans: 不支持的项目类型：%@
zh_hk: 不支援的專案類型：%@

source: Waiting for Host
zh_hans: 等待宿主
zh_hk: 等待宿主

source: Waiting to Refresh
zh_hans: 等待刷新
zh_hk: 等待重新整理
